[
  {
    "Id": "758831",
    "ThreadId": "309041",
    "Html": "<p>Hi.</p>\n<p>I have a SQL database containing the HTML for the pages in my site. I use ADO to pull this out and display it.</p>\n<p>I am in the process of developing a feature which allows me to replace certain phrases with links. This works well at a basic level but I need to do some extra checking to make it work perfectly.</p>\n<p>Basically, I'm pulling out the HTML and, before I pass it to the page, assigning it to a string variable in C#. I then have a second table with two columns: one containing phrases I want to look for; another containing full URLs I want to replace the phrase with. So, for example, if the phrase BBC was found, I replace it &lt;a href=<a href=\"http://www.bbc.co.uk\">http://www.bbc.co.uk</a>&gt;BBC&lt;/a&gt;.</p>\n<p>I'm looping through this second table looking at every phrase, like so:</p>\n<div style=\"background-color: white; color: black;\">\n<pre><span style=\"color: blue;\">while</span> (rdr2.Read())\r\n     {\r\n          tempText = tempText.Replace((<span style=\"color: blue;\">string</span>)rdr2[<span style=\"color: #a31515;\">\"phrase\"</span>], <span style=\"color: #a31515;\">\"&lt;a href=\\\"\"</span> + (<span style=\"color: blue;\">string</span>)rdr2[<span style=\"color: #a31515;\">\"url\"</span>] + <span style=\"color: #a31515;\">\"\\\"&gt;\"</span> + (<span style=\"color: blue;\">string</span>)rdr2[<span style=\"color: #a31515;\">\"phrase\"</span>] + <span style=\"color: #a31515;\">\"&lt;/a&gt;\"</span>);\r\n     }\r\nrdr2.Close();\r\n</pre>\n</div>\n<p>Easy enough.</p>\n<p>**********************</p>\n<p><strong>My Problem</strong></p>\n<p>I need to replace the phrase with the link ONLY when the phrase is not either already within a link or is in a header.</p>\n<p>I've tried checks for \"phrase&lt;/a&gt;\" but these don't work as the phrases in links are often in &lt;span&gt;s within links. The same goes for headers.</p>\n<p>I have been advised that the Html Agility Pack is the way to go.</p>\n<p>I can't find any documentation on it however&nbsp;so would appreciate it if someone could offer modifications to my code to take care of this and, perhaps, a brief explanation so I can undersand it, or a pointer to some documentation.</p>\n<p>Thanks</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>",
    "PostedDate": "2012-02-12T07:35:59.827-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]