[
  {
    "Id": "228205",
    "ThreadId": "67126",
    "Html": "<p>I need xpath grabber from a a web page in IE or FireFox.</p>\r\n<p>There are a plugin in FireFox that does exactly this. you highlight the text taht you want, and view the xpath in the xpather.</p>\r\n<p>the problem is that this is not accurate, and htmlagility pack doesn't understand the xpath. I removed tbody anf form and still it is not perfect.</p>\r\n<p>is there htmlagility add on for firefox or explorer or whatever?</p>\r\n<p>it is just too difucult correct the xpaths of the xpather , i find it very inconvinence.</p>\r\n<p>thanks.</p>",
    "PostedDate": "2009-08-26T19:00:53.05-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "228977",
    "ThreadId": "67126",
    "Html": "<p>Hi</p>\r\n<p>FireFox seem to always add &quot;tbody&quot; elements even when the actual HTML doesn't have any tbody elements. This is then shown in the Addon. I have no knowledge about FF addons so I might be wrong.</p>\r\n<p>The original HAP (HtmlAgilityPack) has some ... issues with form, option, and script-tags. There are several patches and code fixes on Issue Tracker or Discussion. I have myself altered the original HAP to make it work in my use, mostly using the code supplied on this website.</p>\r\n<p>I too use the FireFox addon, but with the use of HAP itself, I created a WinForms app with a TreeView, the treeview lists nodes as HAP sees them, and I can click each node and the respective XPath is availiable for me. This tool also helps me spot bugs HAP has. I have 2 versions, one using the original HAP release and one using the HAP I have modified.</p>\r\n<p>One issue is that you should know how HAP works, without this knowledge you can test yourself to pieces and still don't get anything.</p>\r\n<p>It's kind of silly when HAP &quot;dies&quot; after a &lt;script&gt;-tag, which usually is at the top of the page, and your XPath is fine, the HTML is fine, and you get no errors ...&nbsp;the pain!</p>\r\n<p>I plan to publish a patch for HAP combining all existing patches and fixes. But since my focus is on the project that is using HAP and not HAP itself, my dedication for this goal is limited. Hopefully DarthObiwan and I can join forces and try get something out.</p>",
    "PostedDate": "2009-08-29T08:18:49.497-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "229778",
    "ThreadId": "67126",
    "Html": "<p>can you please compile the winform and post it here for download? of ther released version of course.</p>\r\n<p>I guess patches can wait till next version.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-01T09:47:34.697-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "502084",
    "ThreadId": "67126",
    "Html": "<p>yes please!!!</p>",
    "PostedDate": "2010-10-04T08:39:47.617-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]