[
  {
    "Id": "275569",
    "ThreadId": "80397",
    "Html": "<p>and also another Q</p>\r\n<p>can htmlnode be click-ball that mean if i click on a node what happand ? and if it possible?</p>",
    "PostedDate": "2010-01-11T02:00:44.88-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "275652",
    "ThreadId": "80397",
    "Html": "<p>Html Agility Pack does not provide any browser engine functionality. No Javascript or CSS will be applied or available. It is a simple parser of HTML markup.</p>\r\n<p>I'm confused about your second question, click on a node?</p>",
    "PostedDate": "2010-01-11T05:00:16.237-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "275859",
    "ThreadId": "80397",
    "Html": "<p>i mean if u had a node and it got &nbsp; event such as onclick or click or any other event and u want</p>\r\n<p>to active the event .</p>\r\n<p>if it possible ?</p>\r\n<p>and can u tell me what is the advantages of HTML agility over&nbsp; mshtnl.?</p>\r\n<p>and last each node in HTML page got a lot of property why cant is see all them ?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-11T13:21:58.283-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "275891",
    "ThreadId": "80397",
    "Html": "<p>MSHTML and HTML Agility Pack are two very different things.</p>\r\n<p>MSHTML is a rendering engine that provides interactivity with HTML.</p>\r\n<p>Html Agility Pack is a parsing engine that provides the html nodes as data.</p>\r\n<p>In HAP there are no events, no clicking. Even when using HAP as a COM object embedded in a web page as script I can't think of a way that you could initiate on onclick event or code.</p>\r\n<p>If you're looking to parse html and then execute it I think it might be better to do something as a firefox extension. But without knowing the context of the program or the overall goal it is hard to say.</p>",
    "PostedDate": "2010-01-11T14:27:33.993-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]